Terraform Plan:

```
Acquiring state lock. This may take a few moments...
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=1hvc]
module.gke.data.google_container_engine_versions.region: Reading...
module.gcp-network.module.vpc.google_compute_network.network: Refreshing state... [id=projects/gke-terraform-393907/global/networks/gke-network-dev]
module.gke.data.google_compute_zones.available: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/gke-terraform-393907/serviceAccounts/tf-gke-gke-terraform-d-1hvc@gke-terraform-393907.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=gke-terraform-393907/roles/logging.logWriter/serviceAccount:tf-gke-gke-terraform-d-1hvc@gke-terraform-393907.iam.gserviceaccount.com]
module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/gke-terraform-393907/regions/europe-west2]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["europe-west2/gke-subnet-dev"]: Refreshing state... [id=projects/gke-terraform-393907/regions/europe-west2/subnetworks/gke-subnet-dev]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=gke-terraform-393907/roles/monitoring.metricWriter/serviceAccount:tf-gke-gke-terraform-d-1hvc@gke-terraform-393907.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=gke-terraform-393907/roles/monitoring.viewer/serviceAccount:tf-gke-gke-terraform-d-1hvc@gke-terraform-393907.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2023-07-27 19:06:09.689041184 +0000 UTC]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=gke-terraform-393907/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-gke-terraform-d-1hvc@gke-terraform-393907.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.zone: Read complete after 1s [id=2023-07-27 19:06:09.879983279 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/gke-terraform-393907/locations/europe-west2-a/clusters/gke-terraform-dev]
module.gke.google_container_node_pool.pools["node-pool"]: Refreshing state... [id=projects/gke-terraform-393907/locations/europe-west2-a/clusters/gke-terraform-dev/nodePools/node-pool]
local_file.kubeconfig: Refreshing state... [id=85c083f6986da44c9a0842a34169eb89a33a0f01]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke.google_container_cluster.primary has changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/gke-terraform-393907/locations/europe-west2-a/clusters/gke-terraform-dev"
        name                        = "gke-terraform-dev"
        # (27 unchanged attributes hidden)

      ~ node_pool {
          ~ initial_node_count          = 1 -> 2
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/gke-terraform-393907/zones/europe-west2-a/instanceGroupManagers/gke-gke-terraform-dev-node-pool-a0b833f6-grp",
              + "https://www.googleapis.com/compute/v1/projects/gke-terraform-393907/zones/europe-west2-a/instanceGroupManagers/gke-gke-terraform-dev-node-pool-1e972d10-grp",
            ]
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/gke-terraform-393907/zones/europe-west2-a/instanceGroups/gke-gke-terraform-dev-node-pool-a0b833f6-grp",
              + "https://www.googleapis.com/compute/v1/projects/gke-terraform-393907/zones/europe-west2-a/instanceGroups/gke-gke-terraform-dev-node-pool-1e972d10-grp",
            ]
            name                        = "node-pool"
          ~ node_count                  = 2 -> 4
            # (3 unchanged attributes hidden)

          ~ autoscaling {
              ~ max_node_count       = 2 -> 4
              ~ min_node_count       = 1 -> 2
                # (3 unchanged attributes hidden)
            }

          ~ node_config {
              ~ disk_size_gb      = 10 -> 20
                tags              = [
                    "gke-gke-terraform-dev",
                    "gke-gke-terraform-dev-node-pool",
                ]
                # (14 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (22 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "kubeconfig-dev"
      + id                   = (known after apply)
    }

  # module.gke.google_container_node_pool.pools["node-pool"] will be updated in-place
  ~ resource "google_container_node_pool" "pools" {
        id                          = "projects/gke-terraform-393907/locations/europe-west2-a/clusters/gke-terraform-dev/nodePools/node-pool"
        name                        = "node-pool"
        # (10 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count       = 4 -> 12
          ~ min_node_count       = 2 -> 6
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.gke_auth.data.google_client_config.provider will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "provider" {
      + access_token = (sensitive value)
      + id           = (known after apply)
      + project      = (known after apply)
      + region       = (known after apply)
      + zone         = (known after apply)
    }

  # module.gke_auth.data.google_container_cluster.gke_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "gke_cluster" {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + binary_authorization              = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + cost_management_config            = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_l4_ilb_subsetting          = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + gateway_api_config                = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "europe-west2-a"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + mesh_certificates                 = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "gke-terraform-dev"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_pool_defaults                = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + project                           = "gke-terraform-393907"
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + security_posture_config           = (known after apply)
      + self_link                         = (known after apply)
      + service_external_ips_config       = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

Plan saved to GH artifacts.